---
kind: type
id: T:Autodesk.Revit.DB.PaperSource
source: html/1793f147-8422-66a3-8bf2-35fcd1e735d4.htm
---
# Autodesk.Revit.DB.PaperSource

An object that represents a Paper Source of Print Setup within the Autodesk Revit project.

## Syntax (C#)
```csharp
public class PaperSource : APIObject
```

## Remarks
This object derived from the APIObject base object.